<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.pkg.Firefox</string>
	<key>Input</key>
	<dict>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<false/>
		<key>LOCALE</key>
		<string>en-US</string>
		<key>NAME</key>
		<string>Firefox</string>
		<key>RELEASE</key>
		<string>latest</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.Firefox_EN</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>JumpCloudImporter</string>
            <key>Arguments</key>
            <dict>
                <key>JC_DIST</key>
                <string>AWS</string>
				<key>AWS_BUCKET</key>
				<string>jcautopkg</string>
                <key>JC_SYSGROUP</key>
                <string>AutoPkg-%NAME%-%version%</string>
				<key>JC_TYPE</key>
				<string>auto</string>
            </dict>
        </dict>
    </array>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>MozillaURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>8574c91661dc067f31a486239fd8f5685c6f4fa0</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/MozillaURLProvider.py</string>
				<key>sha256_hash</key>
				<string>6f9a06392557c46d5dfccc1daf9455d69e86b6f705f7abbfc60474ffbeae0a77</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.firefox-rc-en_US</key>
			<dict>
				<key>git_hash</key>
				<string>ee4380374058507eaef81f21a28a8045396ab190</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/Firefox.download.recipe</string>
				<key>sha256_hash</key>
				<string>eec7d3edd86e8fbf5cb75d53de7a85a966bf9eea1a8abc663dd52d2740fb9831</string>
			</dict>
			<key>com.github.autopkg.pkg.Firefox_EN</key>
			<dict>
				<key>git_hash</key>
				<string>8332edca4fbafc1e8aff8c119e571f27b4853bb5</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/Firefox.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>9a76ea99d40cf79f2b45a56ee0e8341eeab226f9bcbc7acebfa7bcc20e081b44</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
