<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.pkg.Slack</string>
	<key>Input</key>
	<dict>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<false/>
		<key>DOWNLOAD_URL</key>
		<string>https://slack.com/ssb/download-osx</string>
		<key>NAME</key>
		<string>Slack</string>
		<key>PKG_ID</key>
		<string>com.tinyspeck.slackmacgap</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.killahquam.pkg.slack</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>JumpCloudImporter</string>
            <key>Arguments</key>
            <dict>
                <key>JC_DIST</key>
                <string>AWS</string>
				<key>AWS_BUCKET</key>
				<string>jcautopkg</string>
                <key>JC_SYSGROUP</key>
                <string>AutoPkg-%NAME%-%version%</string>
				<key>JC_TYPE</key>
				<string>auto</string>
				<key>JC_TRIGGER</key>
				<true/>
				<key>JC_REPEAT_TYPE</key>
				<string>minute</string>
				<key>JC_REPEAT_CRON</key>
				<string>0 */5 * * * *</string>
            </dict>
        </dict>
    </array>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.killahquam.download.slack</key>
			<dict>
				<key>git_hash</key>
				<string>40ad9bb8cfd94df951bb24f6418ad158a2b1c9e1</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.killahquam-recipes/Slack/Slack.download.recipe</string>
				<key>sha256_hash</key>
				<string>22b579a5f12fb18798a303af72facd23beca0c94cc30757aafbc0776c9085b25</string>
			</dict>
			<key>com.github.killahquam.pkg.slack</key>
			<dict>
				<key>git_hash</key>
				<string>4498bc796d2a730236fee65af03ab6eca8ebe140</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.killahquam-recipes/Slack/Slack.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>afb12cbbca11367ac52f723906f30b01db3eefc23df29a2597878d8e679feb24</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
